package com.example.radd_e_qadyyani.Utils

class Constant {
    val mainTopics = arrayListOf<String>(
        "কাদিয়ানী ফেতনা সম্পর্কে বড়দের উক্তি",
        "কাদিয়ানীপন্থী বুদ্ধিজীবীদের কয়েকটি কমন প্রশ্ন ও তার উত্তর",
        "মূল বিষয়",
        "বাংলাদেশের কাদিয়ানী উপাসনালয় ও জনপরিসংখ্যা-২০১৩ ইং",
        "অন্যান্য",
        "করণীয়",
        "ফিকহ মিডিয়া",
        "আমাদের সম্পর্কে"
    )

    val mainTopic1 = arrayListOf<String>(
        "1. মুহাদ্দিসুল আসর, আল্লামা সাইয়েদ আনোয়ার শাহ কাশ্মিরী (রহ.) বলেছেন “এই উম্মতের মধ্যে কাদিয়ানী ফেতনার চেয়ে ভয়াবহ আর কোনো ফেতনা সৃষ্টি হয়নি, এর মুকাবিলায় সর্বশক্তি নিয়োগ করে মুসলমানদের ঈমান রক্ষার সংগ্রামে ঝাঁপিয়ে পড়ুন। এটি এমন এক জিহাদ, যার প্রতিদান নিশ্চিত জান্নাত।” (আল উসূলুয যাহাবিয়্যা ফীর রদ্দে আ’লাল কাদিয়ানীয়্যা পৃ-৩৩)। তিনি আরো বলেছেন “নবুওয়তের মিথ্যা দাবীদারদের কুফুরী ফেরাউনের কুফুরী থেকেও জঘন্য।” (ইহতিসাবে কাদিয়ানীয়্যাত ২/১১)।",
        "2. তিনি তার রচনার এক জায়গায় আরও লিখেছেন “আমার শিক্ষকতার যামানায় আমার কাছ থেকে কমপক্ষে দু’হাজার ছাত্র হাদীসের পাঠ গ্রহণ করেছে। আমার হাদীসের সে সমস্ত ছাত্রের নিকট এতটুকুই আবদার করবো, তারা যেন আল্লাহ’র ওয়াস্তে নিজেদের ইলমি-আমলি শক্তি তাহাফফুজে খতমে নবুওয়তের জন্যে ব্যয় করে। তারা যদি এ ব্যাপারে কুতাহি (অলসতা) করে তাহলে আমি হাশরের ময়দানে তাদের আঁচল টেনে ধরবো।” (আখেরী পয়গাম পৃ-২৬, আল্লামা কাশ্মিরী)।",
        "3. আল্লামা ইউসুফ বানূরী (রহ.) বলেছেন “কাদিয়ানী ফেতনার কারণে কাশ্মীরী (রহ.) এর ছয় মাস পর্যন্ত (দুশ্চিন্তায়) ঘুম হয়নি। আল্লামা কাশ্মিরী (রহ.) বলতেন “যারা আমার কাছে হাদীস পড়েছ, সবাইকে আমি ওসীয়ত করছি, তারা যেন কাদিয়ানীদের বিরুদ্ধে সর্বশক্তি ব্যয় করে।” (ইহতিসাবে কাদিয়ানীয়্যত ১৬/২৮৯)।",
        "4. আমি মনে করি “বর্তমান তথ্যপ্রযুক্তির যুগে গবেষণামূলক ও নিয়মতান্ত্রিক কার্যক্রম ছাড়া ভিন্ন আর কোনো পন্থায় কাদিয়ানী মতবাদের মূলোৎপাটন সম্ভব নয়। মির্যা কাদিয়ানীর দাবীসমূহ ও তার ভ্রান্ত দলিল-ইস্তিদলাল সম্পর্কে নিজে বুঝা এবং অন্যকেও বুঝানো, পাশাপাশি আক্রান্ত এলাকায় মারকায (মক্তব/মসজিদ/মাদরাসা) প্রতিষ্ঠার মাধ্যমে দাওয়াতি কাজ অব্যাহত রাখা; এর আর কোনো বিকল্প নেই।”"
    )

    val mainTopic2 = arrayListOf<String>(
        "ইসলামের নামে কাদিয়ানীধর্ম প্রচার প্রতিষ্ঠার ফলে ইসলাম এবং মুসলিম উম্মাহার সমস্যা কোথায়?",
        "রাষ্ট্র কি ফাতাওয়া দিতে পারে?",
        "কোনো রাষ্ট্র কি কারো ধর্ম নিরূপণের অধিকার রাখে?"
    )

    val mainTopic21 = arrayListOf<String>("প্রথমতঃ একজন মুসলিম হিসেবে আপনার-আমার চোখের সামনেই ইসলামের প্রকৃত রূপরেখা বিকৃতিকারীদের সহ্য করার দায়ে কেয়ামতে আল্লাহর নিকট অপরাধীর কাঠগড়ায় আমাদের দাঁড়াতে হবে। দ্বিতীয়তঃ অমুসলিমরা ইসলাম ভেবে ‘কাদিয়ানী ধর্মমত’ গ্রহণ করে প্রতারিত হতে থাকবে। কাদিয়ানীরাও নিজেদেরকে ‘মুসলিম’ ভাবার কারণে তওবাহ করে ইসলামে ফেরার প্রয়োজনবোধ করবেনা। সব চেয়ে বড় কথা, অজ্ঞতাবশতঃ মুসলিম পরিবারগুলো কাদিয়ানীদের সাথে বৈবাহিক সম্পর্কেও জড়িয়ে যাওয়ার সম্ভাবনা থাকবে। এভাবে বলতে গেলে সমস্যা শেষ হবেনা...। সংক্ষেপে...।")
}