package com.mominul.radd_e_qadyyani.Utils

import android.util.Log

class Constant {
    val mainTopics = arrayListOf<String>(
        "কাদিয়ানী ফেতনা সম্পর্কে বড়দের উক্তি",
        "কাদিয়ানীপন্থী বুদ্ধিজীবীদের কয়েকটি কমন প্রশ্ন ও তার উত্তর",
        "মূল বিষয়",
        "বাংলাদেশের কাদিয়ানী উপাসনালয় ও জনপরিসংখ্যা-২০১৩ ইং",
        "অন্যান্য",
        "করণীয়",
        "ফিকহ মিডিয়া",
        "আমাদের সম্পর্কে"
    )

    val mainTopic1 = arrayListOf<String>(
        "1. মুহাদ্দিসুল আসর, আল্লামা সাইয়েদ আনোয়ার শাহ কাশ্মিরী (রহ.) বলেছেন “এই উম্মতের মধ্যে কাদিয়ানী ফেতনার চেয়ে ভয়াবহ আর কোনো ফেতনা সৃষ্টি হয়নি, এর মুকাবিলায় সর্বশক্তি নিয়োগ করে মুসলমানদের ঈমান রক্ষার সংগ্রামে ঝাঁপিয়ে পড়ুন। এটি এমন এক জিহাদ, যার প্রতিদান নিশ্চিত জান্নাত।” (আল উসূলুয যাহাবিয়্যা ফীর রদ্দে আ’লাল কাদিয়ানীয়্যা পৃ-৩৩)। তিনি আরো বলেছেন “নবুওয়তের মিথ্যা দাবীদারদের কুফুরী ফেরাউনের কুফুরী থেকেও জঘন্য।” (ইহতিসাবে কাদিয়ানীয়্যাত ২/১১)।",
        "2. তিনি তার রচনার এক জায়গায় আরও লিখেছেন “আমার শিক্ষকতার যামানায় আমার কাছ থেকে কমপক্ষে দু’হাজার ছাত্র হাদীসের পাঠ গ্রহণ করেছে। আমার হাদীসের সে সমস্ত ছাত্রের নিকট এতটুকুই আবদার করবো, তারা যেন আল্লাহ’র ওয়াস্তে নিজেদের ইলমি-আমলি শক্তি তাহাফফুজে খতমে নবুওয়তের জন্যে ব্যয় করে। তারা যদি এ ব্যাপারে কুতাহি (অলসতা) করে তাহলে আমি হাশরের ময়দানে তাদের আঁচল টেনে ধরবো।” (আখেরী পয়গাম পৃ-২৬, আল্লামা কাশ্মিরী)।",
        "3. আল্লামা ইউসুফ বানূরী (রহ.) বলেছেন “কাদিয়ানী ফেতনার কারণে কাশ্মীরী (রহ.) এর ছয় মাস পর্যন্ত (দুশ্চিন্তায়) ঘুম হয়নি। আল্লামা কাশ্মিরী (রহ.) বলতেন “যারা আমার কাছে হাদীস পড়েছ, সবাইকে আমি ওসীয়ত করছি, তারা যেন কাদিয়ানীদের বিরুদ্ধে সর্বশক্তি ব্যয় করে।” (ইহতিসাবে কাদিয়ানীয়্যত ১৬/২৮৯)।",
        "4. আমি মনে করি “বর্তমান তথ্যপ্রযুক্তির যুগে গবেষণামূলক ও নিয়মতান্ত্রিক কার্যক্রম ছাড়া ভিন্ন আর কোনো পন্থায় কাদিয়ানী মতবাদের মূলোৎপাটন সম্ভব নয়। মির্যা কাদিয়ানীর দাবীসমূহ ও তার ভ্রান্ত দলিল-ইস্তিদলাল সম্পর্কে নিজে বুঝা এবং অন্যকেও বুঝানো, পাশাপাশি আক্রান্ত এলাকায় মারকায (মক্তব/মসজিদ/মাদরাসা) প্রতিষ্ঠার মাধ্যমে দাওয়াতি কাজ অব্যাহত রাখা; এর আর কোনো বিকল্প নেই।”"
    )

    val mainTopic2 = arrayListOf<String>(
        "ইসলামের নামে কাদিয়ানীধর্ম প্রচার প্রতিষ্ঠার ফলে ইসলাম এবং মুসলিম উম্মাহার সমস্যা কোথায়?",
        "রাষ্ট্র কি ফাতাওয়া দিতে পারে?",
        "কোনো রাষ্ট্র কি কারো ধর্ম নিরূপণের অধিকার রাখে?"
    )

    interface Answer {
        fun getAnswer(): ArrayList<String>
    }

    enum class QuestionType(val questionTitle: String) : Answer {
        Q1("ইসলামের নামে কাদিয়ানীধর্ম প্রচার প্রতিষ্ঠার ফলে ইসলাম এবং মুসলিম উম্মাহার সমস্যা কোথায়?") {
            override fun getAnswer() = arrayListOf("প্রথমতঃ একজন মুসলিম হিসেবে আপনার-আমার চোখের সামনেই ইসলামের প্রকৃত রূপরেখা বিকৃতিকারীদের সহ্য করার দায়ে কেয়ামতে আল্লাহর নিকট অপরাধীর কাঠগড়ায় আমাদের দাঁড়াতে হবে। দ্বিতীয়তঃ অমুসলিমরা ইসলাম ভেবে ‘কাদিয়ানী ধর্মমত’ গ্রহণ করে প্রতারিত হতে থাকবে। কাদিয়ানীরাও নিজেদেরকে ‘মুসলিম’ ভাবার কারণে তওবাহ করে ইসলামে ফেরার প্রয়োজনবোধ করবেনা। সব চেয়ে বড় কথা, অজ্ঞতাবশতঃ মুসলিম পরিবারগুলো কাদিয়ানীদের সাথে বৈবাহিক সম্পর্কেও জড়িয়ে যাওয়ার সম্ভাবনা থাকবে। এভাবে বলতে গেলে সমস্যা শেষ হবেনা...। সংক্ষেপে...।")
        },
        Q2("রাষ্ট্র কি ফাতাওয়া দিতে পারে?") {
            override fun getAnswer() = arrayListOf("কাদিয়ানীদের উক্ত প্রশ্নটাই গলদ। কারণ ‘রাষ্ট্রের’ নিকট মুসলমানদের শুধু দাবী এটাই যে, খতমে নবুওয়তের আকীদা অস্বীকারকারী সম্প্রদায় সম্পর্কে কুরআন সুন্নাহ’র আলোকে যে ফাতাওয়া নির্ণীত রয়েছে; রাষ্ট্র শুধুমাত্র সে ফাতাওয়ার আলোকে সংসদে রায় শুনিয়ে দেয়ার ব্যবস্থা করবে।")
        },
        Q3("কোনো রাষ্ট্র কি কারো ধর্ম নিরূপণের অধিকার রাখে?") {
            override fun getAnswer() = arrayListOf("রাষ্ট্রের জন্য জনগণ নয়, বরং জনগণের জন্যই রাষ্ট্র। সেহেতু জনগণের সরকার হিসেবে সংখ্যাগরিষ্ঠ জনগণের দাবী মেনেই কাদিয়ানীদের ব্যাপারে সরকার তার নিজের অবস্থান পরিষ্কার করতে বাধ্য। এটিকে অন্যের ধর্ম নিরূপন বলেনা, বরং এটিকে ধর্ম পালন ও প্রচারের নামে তাদের যে কোনো ধরণের ধোকা ও প্রতারণা থেকে সংখ্যাগরিষ্ঠ মুসলিম জনতার ঈমান-আকীদা হেফাজতের সর্বোত্তম ব্যবস্থাগ্রহণ বলে। এটি সংখ্যাগরিষ্ঠ প্রতিটি মুসলমানের ধর্মীয় ও নাগরিক অধিকারও বটে।")
        }
    }

    fun getQA(question: String): ArrayList<String> {
        for (qType in QuestionType.values()) {
            Log.d("TAG", "getQA: $question")
            Log.d("TAG", "getQA: "+qType.questionTitle)
            val charset = Charsets.UTF_8
            val byteArray1 = question.toByteArray(charset)
            val byteArray2 = qType.questionTitle.toByteArray(charset)
//            println(byteArray.contentToString()) // [72, 101, 108, 108, 111]
//            println(byteArray.toString(charset)) // Hello
            if (byteArray1.contentEquals(byteArray2)) {
                Log.d("TAG", "getQEnum: "+qType.questionTitle)
                return qType.getAnswer()
            }
        }
        return arrayListOf()
    }
}